from src.read_excel import read_excel_file
from src.service import filter_numbers

transactions = read_excel_file("../data/operations.xlsx")


def test_filter_numbers():
    assert filter_numbers(transactions)[0] == {'Дата операции': '18.11.2021 21:15:27', 'Дата платежа': '19.11.2021',
                                               'Номер карты': 'Отсутствует', 'Статус': 'OK', 'Сумма операции': -200.0,
                                               'Валюта операции': 'RUB', 'Сумма платежа': -200.0,
                                               'Валюта платежа': 'RUB', 'Кэшбэк': 'Отсутствует',
                                               'Категория': 'Мобильная связь', 'MCC': 'Отсутствует',
                                               'Описание': 'Тинькофф Мобайл +7 995 555-55-55',
                                               'Бонусы (включая кэшбэк)': 2, 'Округление на инвесткопилку': 0,
                                               'Сумма операции с округлением': 200.0}
    transactions_not = {'Дата операции': '18.11.2021 21:15:27', 'Дата платежа': '19.11.2021',
                        'Номер карты': 'Отсутствует', 'Статус': 'OK', 'Сумма операции': -200.0,
                        'Валюта операции': 'RUB', 'Сумма платежа': -200.0, 'Валюта платежа': 'RUB',
                        'Кэшбэк': 'Отсутствует', 'Категория': 'Мобильная связь', 'MCC': 'Отсутствует',
                        'Бонусы (включая кэшбэк)': 2,
                        'Округление на инвесткопилку': 0, 'Сумма операции с округлением': 200.0}
    assert filter_numbers(transactions_not) == []
